<template>
    <div>
      <p class="warn-content">
        <a href="https://v-charts.js.org/#/" target="_blank">番茄数据展示
        </a>
      </p>
      <ve-line :data="chartData"></ve-line>
    </div>

</template>



<script>
export default {
  data: function() {
    return {
      chartData: {
        // columns: ['日期', '识别数量', '预估产量', '月份'],
        columns: ['日期', '识别数量', '预估产量'],
        rows: [
          { 日期: '1月', 识别数量: 1393, 预估产量: 1093, 下单率: 0.32 },
          { 日期: '2月', 识别数量: 3530, 预估产量: 3230, 下单率: 0.26 },
          { 日期: '3月', 识别数量: 2923, 预估产量: 2623, 下单率: 0.76 },
          { 日期: '4月', 识别数量: 1723, 预估产量: 1423, 下单率: 0.49 },
          { 日期: '5月', 识别数量: 3792, 预估产量: 3492, 下单率: 0.323 },
          { 日期: '6月', 识别数量: 4593, 预估产量: 4293, 下单率: 0.78 }
        ]
      },
      chartData1: {
        columns: ['日期', '访问用户', '下单用户'],
        rows: [
          { 日期: '1/1', 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
          { 日期: '1/2', 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
          { 日期: '1/3', 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
          { 日期: '1/4', 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
          { 日期: '1/5', 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
          { 日期: '1/6', 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 }
        ]
      }
    }
  }
}
</script>
